# FInSymDef

## Description
Function FInSymDef returns a handle to the first component object within the referenced symbol definition.&lt;BR&gt;

```pascal
FUNCTION FInSymDef(sdHd : HANDLE) : HANDLE;
```

```python

def vs.FInSymDef(sdHd):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sdHd|HANDLE|Handle to symbol definition.|

## Version
Availability: from MiniCAD
## Category
* Document List Handling